brew "autoconf"
brew "automake"
brew "btop"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gh"
brew "gnupg"
brew "gnutls"
brew "ipcalc"
brew "keychain"
brew "libgccjit"
brew "libxml2"
brew "libyaml"
brew "nmap"
brew "pkg-config"
brew "pwgen"
brew "ripgrep"
brew "subnetcalc"
brew "texinfo"
brew "tree"
brew "tree-sitter"
cask "alacritty"

if !Hardware::CPU.arm?
  cask "gfxcardstatus"
end

cask "google-chrome"
cask "logi-options+"
cask "monitorcontrol"
cask "rectangle"
cask "skim"
cask "stats"
